Revit 2026 API

# ConfigurationReloadInfo Class

---

This object contains information returned by a reload of the fabrication configuration.

SystemObject Autodesk.Revit.DBConfigurationReloadInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConfigurationReloadInfo : IDisposable
```
```vb
Public Class ConfigurationReloadInfo
	Implements IDisposable
```
```cpp
public ref class ConfigurationReloadInfo : IDisposable
```
```fsharp
type ConfigurationReloadInfo =
    class
        interface IDisposable
    end
```

The ConfigurationReloadInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConfigurationReloadInfo | Constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | Disconnects | The number of disconnections caused by the reload. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OutOfDatePartCount | The number of fabrication part instances that had newer versions and were out of date. |
|  | ProfileNotAvailable | The current profile is not available in the disk configuration. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConfigurationReloadInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetConnectivityValidation | Returns information about the post-reload connectivity validation. |
|  | GetCustomDataChangedElements | Gets a list of ElementIds of fabrication parts that had custom data updated during the reload. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOutOfDatePartStatus | Access reload information for out of date part. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace